Public Member Functions | Protected Member Functions | Static Protected Member Functions | Friends | List of all members
ACAPI::MEP::v1::BendDefault Class Referencefinal
MEP Element Manager
The BendDefault contains the necessary non-geometric data for modifying a Bend. More...
#include <MEPBendDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::BendDefault:
 Public Member Functions
Result< double >  | GetFactorRadius () const
The radius of the Bend is calculated with the help of this value in the case of Duct and Cable Carrier.
Result< UniqueID >  | GetPreferenceTable () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
Result< void >  | SetFactorRadius (double factor)
Sets the factor of the radius of the BendDefault in the case of Duct and Cable Carrier.
Result< void >  | SetPreferenceTable (const UniqueID &tableId)
Sets the PreferenceTable of the BendDefault in the case of Pipe. This PreferenceTable will be transferred into the Bends when a route is placed or modified.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
Result< Domain >  | GetDomainOfPort (uint32_t portIndex) const
Result< VentilationPortDefault >  | GetVentilationPortDefault (uint32_t portIndex) const
Result< PipingPortDefault >  | GetPipingPortDefault (uint32_t portIndex) const
Result< CableCarrierPortDefault >  | GetCableCarrierPortDefault (uint32_t portIndex) const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Public Member Functions inherited from ACAPI::v1::ElementDefault
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
BendDefault (std::shared_ptr< Impl::IBendDefaultImpl > impl)
Constructs a BendDefault with the given bend default implementation.
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Constructs an ElementDefault with the given element default implementation.
Modifier (ElementDefault &parent)
Constructs a Modifier with the given parent ElementDefault.
 Protected Member Functions inherited from ACAPI::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Static Protected Member Functions
static Result< BendDefault >  | Create (const API_Token &token, Domain domain)
Creates a BendDefault with the given token and domain.
 Friends
 class  | ACAPI::Impl::ObjectCreator
Result< BendDefault >  | CreateBendDefault (Domain)
Creates a BendDefault.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The BendDefault contains the necessary non-geometric data for modifying a Bend.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at RoutingElementDefault and RoutingNodeDefault
Constructor & Destructor Documentation
◆ BendDefault()
 ACAPI::MEP::v1::BendDefault::BendDefault  |  ( |  std::shared_ptr< Impl::IBendDefaultImpl >  |  impl | )
protected
Constructs a BendDefault with the given bend default implementation.
Parameters
impl | The given bend default implementation.
Member Function Documentation
◆ Create()
 static Result< BendDefault > ACAPI::MEP::v1::BendDefault::Create  |  ( |  const API_Token &  |  token,
|  Domain  |  domain
)
staticprotected
Creates a BendDefault with the given token and domain.
Parameters
token | The given token.
domain | The given domain.
Returns
The result of the creation with the created BendDefault.
◆ GetFactorRadius()
 Result< double > ACAPI::MEP::v1::BendDefault::GetFactorRadius  |  ( |   | ) |   const
The radius of the Bend is calculated with the help of this value in the case of Duct and Cable Carrier.
Returns
Returns the factor of the BendDefault in the case of Duct and Cable Carrier, otherwise Error.
◆ GetPreferenceTable()
 Result< UniqueID > ACAPI::MEP::v1::BendDefault::GetPreferenceTable  |  ( |   | ) |   const
Returns
Returns the UniqueID of the PreferenceTable of a PipeBendDefault or a circular DuctBendDefault, in case of rectangular DuctBendDefault and CableCarrierBendDefault returns Error.
◆ Modify()
 template<class ModifierFunc >
 Result< void > ACAPI::MEP::v1::BendDefault::Modify  |  ( |  ModifierFunc &&  |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetFactorRadius()
 Result< void > ACAPI::MEP::v1::BendDefault::SetFactorRadius  |  ( |  double  |  factor | )
Sets the factor of the radius of the BendDefault in the case of Duct and Cable Carrier.
Parameters
factor | The value to be set. Needs to be larger than 0.6.
Returns
Returns an error in case of Pipe Bend or if the factor parameter is too small, otherwise nothing.
◆ SetPreferenceTable()
 Result< void > ACAPI::MEP::v1::BendDefault::SetPreferenceTable  |  ( |  const UniqueID &  |  tableId | )
Sets the PreferenceTable of the BendDefault in the case of Pipe. This PreferenceTable will be transferred into the Bends when a route is placed or modified.
Parameters
tableId | The UniqueID referring to the PreferenceTable to be set.
Returns
Returns an error in the case of rectangular Duct Bend and Cable Carrier Bend or if the referred ElbowTable can not be found, otherwise nothing.
Friends And Related Symbol Documentation
◆ CreateBendDefault
 Result< BendDefault > CreateBendDefault  |  ( |  Domain  |  domain | )
friend
Creates a BendDefault.
Parameters
domain | The Domain of the requested BendDefault.
Returns
If able, returns a copy of Archicad's current Default of the Bend from the RoutingElement tool for the domain defined by the parameter, otherwise Error.